Jmeter/jmeter.log
2022-09-15 20:04:52,363 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2022-09-15 20:04:52,405 INFO o.a.j.JMeter: Loading user properties from: /home/dima/QA_progs/apache-jmeter-5.3/bin/user.properties
2022-09-15 20:04:52,406 INFO o.a.j.JMeter: Loading system properties from: /home/dima/QA_progs/apache-jmeter-5.3/bin/system.properties
2022-09-15 20:04:52,408 INFO o.a.j.JMeter: Copyright (c) 1998-2020 The Apache Software Foundation
2022-09-15 20:04:52,409 INFO o.a.j.JMeter: Version 5.3
2022-09-15 20:04:52,409 INFO o.a.j.JMeter: java.version=11.0.10
2022-09-15 20:04:52,409 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2022-09-15 20:04:52,409 INFO o.a.j.JMeter: os.name=Linux
2022-09-15 20:04:52,410 INFO o.a.j.JMeter: os.arch=amd64
2022-09-15 20:04:52,410 INFO o.a.j.JMeter: os.version=5.4.0-70-generic
2022-09-15 20:04:52,410 INFO o.a.j.JMeter: file.encoding=UTF-8
2022-09-15 20:04:52,410 INFO o.a.j.JMeter: java.awt.headless=true
2022-09-15 20:04:52,410 INFO o.a.j.JMeter: Max memory     =1073741824
2022-09-15 20:04:52,411 INFO o.a.j.JMeter: Available Processors =4
2022-09-15 20:04:52,429 INFO o.a.j.JMeter: Default Locale=English (EN)
2022-09-15 20:04:52,430 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2022-09-15 20:04:52,430 INFO o.a.j.JMeter: JMeterHome=/home/dima/QA_progs/apache-jmeter-5.3
2022-09-15 20:04:52,430 INFO o.a.j.JMeter: user.dir  =/home/dima/Завантаження/Hillel/Test_2022/Jmeter
2022-09-15 20:04:52,430 INFO o.a.j.JMeter: PWD       =/home/dima/Завантаження/Hillel/Test_2022/Jmeter
2022-09-15 20:04:52,430 INFO o.a.j.JMeter: IP: 127.0.1.1 Name: dima-Lenovo-H430 FullName: dima-Lenovo-H430
2022-09-15 20:04:52,434 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'/home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports'
2022-09-15 20:04:52,439 INFO o.a.j.s.FileServer: Default base='/home/dima/Завантаження/Hillel/Test_2022/Jmeter'
2022-09-15 20:04:52,445 INFO o.a.j.s.FileServer: Set new base='/home/dima/Завантаження/Hillel/Test_2022/Jmeter'
2022-09-15 20:04:52,865 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2022-09-15 20:04:52,905 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2022-09-15 20:04:52,913 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2022-09-15 20:04:52,922 INFO o.a.j.s.SaveService: Loading file: /home/dima/Завантаження/Hillel/Test_2022/Jmeter/Garage.jmx
2022-09-15 20:04:52,988 INFO o.a.j.p.h.c.CookieManager: Settings: Delete null: true Check: true Allow variable: true Save: false Prefix: COOKIE_
2022-09-15 20:04:52,997 INFO o.a.j.p.h.c.CacheManager: Will only cache the following methods: [GET]
2022-09-15 20:04:53,015 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-15 20:04:53,016 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-15 20:04:53,016 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-15 20:04:53,016 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2022-09-15 20:04:53,016 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2022-09-15 20:04:53,016 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2022-09-15 20:04:53,118 INFO o.a.j.JMeter: Creating summariser <summary>
2022-09-15 20:04:53,130 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2022-09-15 20:04:53,130 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: report.csv
2022-09-15 20:04:53,130 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: /home/dima/QA_progs/apache-jmeter-5.3/bin/reportgenerator.properties
2022-09-15 20:04:53,132 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2022-09-15 20:04:53,138 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2022-09-15 20:04:53,143 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2022-09-15 20:04:53,144 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2022-09-15 20:04:53,144 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2022-09-15 20:04:53,144 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2022-09-15 20:04:53,146 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2022-09-15 20:04:53,146 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2022-09-15 20:04:53,146 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2022-09-15 20:04:53,147 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2022-09-15 20:04:53,158 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,158 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,159 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,159 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,159 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,160 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,160 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,160 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,161 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,161 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2022-09-15 20:04:53,163 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2022-09-15 20:04:53,163 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2022-09-15 20:04:53,163 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2022-09-15 20:04:53,164 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2022-09-15 20:04:53,165 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2022-09-15 20:04:53,165 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2022-09-15 20:04:53,181 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2022-09-15 20:04:53,185 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-09-15 20:04:53,185 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2022-09-15 20:04:53,198 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2022-09-15 20:04:53,198 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2022-09-15 20:04:54,042 INFO o.a.j.JMeter: Running test (1663261494042)
2022-09-15 20:04:54,101 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Thread Group with JSON
2022-09-15 20:04:54,101 INFO o.a.j.e.StandardJMeterEngine: Starting 2 threads for group Thread Group with JSON.
2022-09-15 20:04:54,102 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2022-09-15 20:04:54,102 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=2 ramp-up=1 delayedStart=false
2022-09-15 20:04:54,142 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2022-09-15 20:04:54,143 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2022-09-15 20:04:54,167 INFO o.a.j.t.JMeterThread: Thread started: Thread Group with JSON 1-1
2022-09-15 20:04:54,219 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = dima-Lenovo-H430
2022-09-15 20:04:54,231 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2022-09-15 20:04:54,235 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2022-09-15 20:04:54,236 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2022-09-15 20:04:54,237 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2022-09-15 20:04:54,238 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2022-09-15 20:04:54,517 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2022-09-15 20:04:54,531 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2022-09-15 20:04:54,532 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2022-09-15 20:04:54,642 INFO o.a.j.t.JMeterThread: Thread started: Thread Group with JSON 1-2
2022-09-15 20:04:54,804 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2022-09-15 20:04:54,811 INFO o.a.j.u.SSLManager: KeyStore created OK
2022-09-15 20:04:54,811 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2022-09-15 20:04:56,111 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group with JSON 1-1
2022-09-15 20:04:56,111 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group with JSON 1-1
2022-09-15 20:04:56,116 INFO o.a.j.t.JMeterThread: Thread is done: Thread Group with JSON 1-2
2022-09-15 20:04:56,116 INFO o.a.j.t.JMeterThread: Thread finished: Thread Group with JSON 1-2
2022-09-15 20:04:56,117 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2022-09-15 20:04:56,119 INFO o.a.j.r.Summariser: summary =     10 in 00:00:02 =    4.8/s Avg:   241 Min:    52 Max:  1112 Err:     8 (80.00%)
2022-09-15 20:04:56,119 INFO o.a.j.JMeter: Generating Dashboard
2022-09-15 20:04:56,120 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2022-09-15 20:04:56,145 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2022-09-15 20:04:56,302 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2022-09-15 20:04:56,302 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2022-09-15 20:04:56,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2022-09-15 20:04:56,307 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2022-09-15 20:04:56,330 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2022-09-15 20:04:56,334 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2022-09-15 20:04:56,335 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2022-09-15 20:04:56,335 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2022-09-15 20:04:56,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2022-09-15 20:04:56,350 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2022-09-15 20:04:56,351 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2022-09-15 20:04:56,351 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2022-09-15 20:04:56,354 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2022-09-15 20:04:56,355 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 70 samples
2022-09-15 20:04:56,355 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2022-09-15 20:04:56,355 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2022-09-15 20:04:56,355 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2022-09-15 20:04:56,356 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2022-09-15 20:04:56,356 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2022-09-15 20:04:56,357 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2022-09-15 20:04:56,360 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2022-09-15 20:04:56,360 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2022-09-15 20:04:56,360 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2022-09-15 20:04:56,360 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2022-09-15 20:04:56,361 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 150 samples
2022-09-15 20:04:56,361 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 30 samples
2022-09-15 20:04:56,361 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 10 samples
2022-09-15 20:04:56,362 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 10 samples produced in 155ms on channel 0
2022-09-15 20:04:56,362 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2022-09-15 20:04:56,366 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2022-09-15 20:04:56,366 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2022-09-15 20:04:56,367 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2022-09-15 20:04:56,368 INFO o.a.j.r.d.JsonExporter: Checking output folder
2022-09-15 20:04:56,368 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to /home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports/statistics.json
2022-09-15 20:04:56,854 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2022-09-15 20:04:56,858 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: /home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports
2022-09-15 20:04:57,150 ERROR f.configuration: DefaultObjectWrapper.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2022-09-15 20:04:57,154 ERROR f.configuration: Configuration.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2022-09-15 20:04:57,175 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: /home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports, creating folder structure
2022-09-15 20:04:57,180 INFO o.a.j.r.d.TemplateVisitor: Copying folder from '/home/dima/QA_progs/apache-jmeter-5.3/bin/report-template' to '/home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports', got message: /home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports, found non empty folder with following content [/home/dima/Завантаження/Hillel/Test_2022/Jmeter/Reports/statistics.json], will be ignored
2022-09-15 20:04:57,856 INFO o.a.j.JMeter: Dashboard generated